**recalling** 
subpass-app(dev)> a.object_id
=> 266620
subpass-app(dev)> b="s"
=> "s"
subpass-app(dev)> b.object_id
=> 277260
subpass-app(dev)> a=:a
=> :a
subpass-app(dev)> a.object_id
=> 688988
subpass-app(dev)> b=:a
=> :a
subpass-app(dev)> b.object_id
=> 688988
subpass-app(dev)> 